{
    "0": {
        "key": "〜ましょう",
        "meaning_en": "① An expression to invite someone to do something together.<br/>② Also used to reply to an invitation.",
        "meaning_bd": "① কাউকে একসাথে কিছু করার জন্য আমন্ত্রণ জানানোর একটি প্রকাশভঙ্গী ।<br/>② আমন্ত্রণের উত্তরেও ব্যবহার করা হয়।",
        "form": "V（ます形）<s>ます</s>  + しょう",
        "exampleSentence": [
            {
                "jp": "いっしょに かえりましょう。",
                "en": "Let's go home together.",
                "bd": "একসাথে বাড়ি চলুন।"
            },
            {
                "jp": "のみに いきましょう。",
                "en": "Let's go out for a drink.",
                "bd": "চলুন পান করতে যাই।"
            },
            {
                "jp": "としょかん で いっしょ に べんきょう しましょう。",
                "en": "Let's study together in the library.",
                "bd": "লাইব্রেরিতে একসাথে পড়াশোনা করি।"
            }
        ]
    },
    "1": {
        "key": "AながらB",
        "meaning_en": "To do two things simultaneously<br/>to do B while doing A",
        "meaning_bd": "'একসাথে দুটি কাজ করা'<br/>কোন একটি কাজ B অন্য একটি কাজ A এর সাথে করা",
        "form": "V<s>マス</s> + ながら",
        "exampleSentence": [
            {
                "jp": "にほんご の べんきょう を しながら テレビ を みます。",
                "en": "I watch TV while studying Japanese.",
                "bd": "জাপানি পড়াশোনা করার সময় টিভি দেখি।"
            },
            {
                "jp": "でんわ しながら くるま を うんてん して は いけません。",
                "en": "You must not talk on the phone while driving.",
                "bd": "গাড়ি চালানোর সময় ফোনে কথা বলা উচিত নয়।"
            },
            {
                "jp": "しんぶん を よみながら あさごはん を たべます。",
                "en": "I eat breakfast while reading the newspaper.",
                "bd": "পত্রিকা পড়ার সময় সকালের নাস্তা করি।"
            }
        ]
    },
    "2": {
        "key": "〜方（かた）",
        "meaning_en": "The way of doing something / how to do",
        "meaning_bd": "কিছু করার উপায় / কিভাবে করা হয়",
        "form": "V(ます形)<s>ます</s> + 方",
        "exampleSentence": [
            {
                "jp": "およぎ かた を おしえて いただけませんか。",
                "en": "Could you please teach me how to swim?",
                "bd": "আপনিই কি আমাকে কীভাবে সাঁতার কাটতে হয় তা শেখাতে পারবেন?"
            },
            {
                "jp": "ATM の つかい かた を おしえて いただけませんか。",
                "en": "Can you teach me how to use an ATM?",
                "bd": "আপনি কি আমাকে ATM ব্যবহার করতে শেখাতে পারেন?"
            },
            {
                "jp": "この かんじ の よみ かた を おしえて ください。",
                "en": "Please tell me how to read this kanji.",
                "bd": "দয়া করে আমাকে এই কঞ্জির পড়ার উপায় বলুন।"
            }
        ]
    },
    "3": {
        "key": "〜ないで",
        "meaning_en": "To do B without doing A",
        "meaning_bd": "কিছু না করে কিছু করা (A না করে B করা)",
        "form": "V(ない形) + ないで",
        "exampleSentence": [
            {
                "jp": "けさ、あさごはん を たべないで がっこう に きました。",
                "en": "This morning, I came to school without eating breakfast.",
                "bd": "আজ সকালে নাস্তা না করেই স্কুলে এলাম।"
            },
            {
                "jp": "わたし は まいにち、でんき を けさないで ねます。",
                "en": "I sleep without turning off the lights every day.",
                "bd": "আমি প্রতিদিন বাতি নিভিয়ে না ঘুমাই।"
            },
            {
                "jp": "さいきん、すずしい の で、エアコン を つけないで ねます。",
                "en": "I sleep without turning on the air conditioner because it is cooler these days.",
                "bd": "এই কয়দিন ঠান্ডা বলে, এয়ারকন্ডিশন না চালিয়েই ঘুমাই।"
            }
        ]
    },
    "4": {
        "key": "〜とき",
        "meaning_en": "When something happens",
        "meaning_bd": "যখন কিছু ঘটে",
        "form": "V（普） + とき<br/>イAい + とき<br/>ナAな + とき<br/>N + のとき",
        "exampleSentence": [
            {
                "jp": "ごはん を たべる とき、「いただきます」と いいます。",
                "en": "When we eat, we say 'Itadakimasu'.",
                "bd": "আমরা যখন খাই, তখন 'ইতাদাকিমাসু' বলি।"
            },
            {
                "jp": "ねる とき、わたし は でんき を けしません。",
                "en": "When I go to bed, I don't turn off the lights.",
                "bd": "আমি যখন ঘুমাতে যাই, আমি বাতি নিভাই না।"
            },
            {
                "jp": "コーヒー を のむ とき、さとう を いれます か。",
                "en": "When you drink coffee, do you put sugar in it?",
                "bd": "আপনি যখন কফি খান, আপনি কি তাতে চিনি দেন?"
            }
        ]
    },
    "5": {
        "key": "〜ないでください",
        "meaning_en": "Please don't do / giving warning not to do",
        "meaning_bd": "অনুগ্রহ করে করবেন না / কিছু না করার জন্য সতর্কবার্তা",
        "form": "V(ない形) + ないでください",
        "exampleSentence": [
            {
                "jp": "そちら の え に さわらないで ください。",
                "en": "Please don't touch that picture.",
                "bd": "অনুগ্রহ করে ঐ ছবিতে হাত দেবেন না।"
            },
            {
                "jp": "それ は うりもの です から、すわらないで ください。",
                "en": "It's for sale, so don't sit on it.",
                "bd": "এটি বিক্রির জন্য, তাই তাতে বসবেন না।"
            },
            {
                "jp": "えいがかん の なか で しゃしん を とらないで ください。",
                "en": "Please don't take pictures in the theater.",
                "bd": "অনুগ্রহ করে সিনেমা হলে ছবি তুলবেন না।"
            }
        ]
    },
    "6": {
        "key": "〜てもいいですか",
        "meaning_en": "May I 〜? / Can I 〜?<br/>Used for asking permission to do something.",
        "meaning_bd": "আমি কি 〜 করতে পারি?<br/>কিছু করার অনুমতি চাইতে ব্যবহৃত হয়।",
        "form": "V(て形) + てもいいですか",
        "exampleSentence": [
            {
                "jp": "ちょっと さむい の で、エアコン を けして も いいですか。",
                "en": "It's a little cold, can I turn off the air conditioner?",
                "bd": "একটু ঠান্ডা, আমি কি এয়ার কন্ডিশনার বন্ধ করতে পারি?"
            },
            {
                "jp": "へや が すこし くらい の で、でんき を つけて も いいですか。",
                "en": "The room is a little dark, can I turn on the light?",
                "bd": "ঘরটি একটু অন্ধকার, আমি কি আলো জ্বালাতে পারি?"
            },
            {
                "jp": "せんせい、すみません。トイレ に いって も いいですか。",
                "en": "Excuse me, teacher. May I go to the restroom?",
                "bd": "মাফ করবেন, শিক্ষক। আমি কি টয়লেটে যেতে পারি?"
            }
        ]
    },
    "7": {
        "key": "〜なる",
        "meaning_en": "expresses a change of state. The state A changes and transforms into state B.",
        "meaning_bd": "অবস্থার পরিবর্তন প্রকাশ করে। A অবস্থা থেকে পরিবর্তিত হয়ে B অবস্থায় রূপান্তরিত হওয়া বুঝায়।",
        "form": "[接続]<br/>イAく ＋ なる<br/>ナAに + なる<br/>Nに + なる",
        "exampleSentence": [
            {
                "jp": "ごねん ぶり に あった けど、だいぶ せ が たかく なった ね。",
                "en": "I haven't seen you in five years, but you've gotten a lot taller.",
                "bd": "আমি পাঁচ বছর ধরে আপনাকে দেখিনি, কিন্তু আপনি অনেক লম্বা হয়ে গেছেন।"
            },
            {
                "jp": "ろくがつ に はいって、ちょっと あつく なった ね。",
                "en": "It's getting a little hot in June, isn't it?",
                "bd": "জুন মাসে একটু গরম হচ্ছে, তাই না?"
            },
            {
                "jp": "くらく なって きました ね。そろそろ かえりましょう か。",
                "en": "It's getting dark. Shall we go home soon?",
                "bd": "অন্ধকার হয়ে আসছে। আমরা কি শীঘ্রই বাড়ি যাব?"
            }
        ]

    },
    "8": {
        "key": "〜前に",
        "meaning_en": "before - An expression used to indicate which of two actions should be done first.",
        "meaning_bd": "পূর্বে - দুইটি ঘটনার মধ্যে একটি ঘটনা আগে ঘটা বুঝায়।",
        "form": "V（辞書形）+ 前に<br/>N + の前に<br/>N（期間） + 前に",
        "exampleSentence": [
            {
                "jp": "りょこう する まえ に、かんこうち や おすすめ の レストラン など を しらべて おきます。",
                "en": "I will research tourist spots and recommended restaurants before I travel.",
                "bd": "আমি ভ্রমণের আগে পর্যটন স্পট এবং সুপারিশকৃত রেস্তোরাঁগুলি খুঁজে বের করব।"
            },
            {
                "jp": "バス に のる まえ に、くすり を のんで おきます。",
                "en": "I will take my medication before getting on the bus.",
                "bd": "আমি বাসে ওঠার আগে ওষুধ খাব।"
            },
            {
                "jp": "ねる まえ に、すこし にほんご を べんきょう します。",
                "en": "I will study Japanese a little before going to bed.",
                "bd": "আমি ঘুমানোর আগে একটু জাপানি পড়ব।"
            }
        ]
    },
    "9": {
        "key": "〜てはいけない",
        "meaning_en": "'must not'<br/>Indicates a prohibition or regulation.",
        "meaning_bd": "'করতে পারবে না'<br/>নিষেধাজ্ঞা বা নিয়ম নির্দেশ করে।",
        "form": "V(て形) + はいけない。",
        "exampleSentence": [
            {
                "jp": "この かわ で およいで は いけません。",
                "en": "You must not swim in this river.",
                "bd": "এই নদীতে সাঁতার কাটা নিষেধ।"
            },
            {
                "jp": "じゅぎょうちゅう に けいたい でんわ を つかって は いけません。",
                "en": "You must not use your cell phone in class.",
                "bd": "ক্লাসে মোবাইল ফোন ব্যবহার করা নিষেধ।"
            },
            {
                "jp": "としょかん で うるさく して は いけません。",
                "en": "You must not be noisy in the library.",
                "bd": "লাইব্রেরিতে গোলমাল করা নিষেধ।"
            }
        ]
    },
    "10": {
        "key": "〜たり〜たり",
        "meaning_en": "V1 and V2<br/>An expression to mention two or three representative items from among several.",
        "meaning_bd": "V1 and V2<br/>বিভিন্ন কর্মকান্ডের মধ্য হতে কিছু নির্বাচিত কাজ উল্লেখ করার জন্য একটি অভিব্যক্তি।",
        "form": "V1（タ形）+ り + V2 （タ形）+ り",
        "exampleSentence": [
            {
                "jp": "どようび は かいもの したり、えいが を みたり しました。",
                "en": "On Saturday, I went shopping and watched a movie.",
                "bd": "শনিবার, আমি কেনাকাটা করেছি এবং একটি সিনেমা দেখেছি।"
            },
            {
                "jp": "やすみ の ひ は、たいてい いえ で YouTube を みたり、おんがく を きいたり しています。",
                "en": "On my days off, I usually watch YouTube or listen to music at home.",
                "bd": "ছুটির দিনে আমি সাধারণত বাড়িতে YouTube দেখি অথবা সংগীত শুনি।"
            },
            {
                "jp": "こんど の なつやすみ は、はなび を みたり、うみ へ およぎ に いったり する つもり です。",
                "en": "I plan to watch fireworks and go swimming in the sea during my upcoming summer vacation.",
                "bd": "আগামী গ্রীষ্মের ছুটিতে আমি আতশবাজি দেখার এবং সমুদ্রে সাঁতার কাটতে যাওয়ার পরিকল্পনা করছি।"
            }
        ]
    },
    "11": {
        "key": "〜ましょうか",
        "meaning_en": "'Shall I ~ ?'<br/>Used to offer to help for the listener.",
        "meaning_bd": "'~ করবো?'<br/>শ্রোতার জন্য সহায়তা প্রস্তাব করতে ব্যবহৃত হয়।",
        "form": "V(ます形)ます + しょうか",
        "exampleSentence": [
            {
                "jp": "にもつ を もちましょうか。",
                "en": "Shall I carry your luggage?",
                "bd": "আমি আপনার লাগেজ নিয়ে আসবো?"
            },
            {
                "jp": "かさ を かしましょうか。",
                "en": "Shall I lend you an umbrella?",
                "bd": "আমি আপনাকে একটি ছাতা ধার দেব?"
            },
            {
                "jp": "たくしー を よびましょうか。",
                "en": "Shall I call a cab?",
                "bd": "আমি কি একটা ট্যাক্সি ডাকবো?"
            }
        ]
    },
    "12": {
        "key": "〜で（手段・方法）",
        "meaning_en": "'by'<br/>Indicates methods or means",
        "meaning_bd": "'দ্বারা'<br/>কোন কিছু করার মাধ্যম বা উপায় বুঝায়",
        "form": "",
        "exampleSentence": [
            {
                "jp": "YouTube で にほんご を べんきょう します。",
                "en": "I will study Japanese through YouTube.",
                "bd": "আমি YouTube এর মাধ্যমে জাপানি ভাষা শিখব।"
            },
            {
                "jp": "はし で ごはん を たべます。",
                "en": "I eat rice with chopsticks.",
                "bd": "আমি চপস্টিক দিয়ে ভাত খাই।"
            },
            {
                "jp": "て で すし を たべます。",
                "en": "I eat sushi with my hands.",
                "bd": "আমি হাতে সুশি খাই।"
            }
        ]
    },
    "13": {
        "key": "〜は〜より・・・です",
        "meaning_en": "A is more ~ than B.<br/>An expression that compares two things.",
        "meaning_bd": "A বেশি ~ B-এর থেকে।<br/>দুইটি জিনিসের তুলনা করতে ব্যাবহৃত হয়",
        "form": "N1は N2より Adjectiveです",
        "exampleSentence": [
            {
                "jp": "エベレストさん は ふじさん より たかい です。",
                "en": "Mt. Everest is higher than Mt. Fuji.",
                "bd": "এভারেস্ট পর্বত ফুজি পর্বতের তুলনায় উচ্চতর।"
            },
            {
                "jp": "トムさん は ジェームスさん より せ が たかい です。",
                "en": "Tom is taller than James.",
                "bd": "টম জেমসের তুলনায় দীর্ঘ।"
            },
            {
                "jp": "ちゅうごく は にほん より おおきい です。",
                "en": "China is bigger than Japan.",
                "bd": "চীন জাপানের তুলনায় বড়।"
            }
        ]
    },
    "14": {
        "key": "〜なくてもいい",
        "meaning_en": "don't have to",
        "meaning_bd": "করতে হবে না।",
        "form": "V（ナイ形）な<s>い</s> + くてもいい",
        "exampleSentence": [
            {
                "jp": "やったー。あした は やすみ だから、がっこう に いかなくても いい。",
                "en": "Yay. I have a day off tomorrow, so I don't have to go to school.",
                "bd": "ওয়াহ। আমার আগামীকাল ছুটি আছে, তাই আমাকে স্কুলে যেতে হবে না।"
            },
            {
                "jp": "まえ の てすと で ８０てん いじょう とった ひとは、ほしゅうじゅぎょう を うけなくても いい です。",
                "en": "Those who got 80 points or more in the previous test don't have to take make-up classes.",
                "bd": "যারা আগের পরীক্ষায় ৮০ পয়েন্ট বা তার বেশি পেয়েছে, তাদের মেক-আপ ক্লাসে যেতে হবে না।"
            },
            {
                "jp": "この かんじ は まだ かけなくても いい です。よめれ ば だいじょうぶ です。",
                "en": "You don't need to be able to write this kanji yet. It's okay if you can only read it.",
                "bd": "আপনাকে এখনও এই কঞ্জি লিখতে সক্ষম হতে হবে না। আপনি যদি কেবল পড়তে পারেন তবে এটি ঠিক।"
            }
        ]
    },
    "15": {
        "key": "ぜひ",
        "meaning_en": "by all means / really<br/>An expression that emphasizes a request or desire.",
        "meaning_bd": "নিশ্চয়ই / সত্যিই<br/>জোর দিয়ে কোন কিছুর অনুরোধ বা আকাঙ্ক্ষা প্রকাশে ব্যাবহৃত হয়",
        "form": "",
        "exampleSentence": [
            {
                "jp": "ぜひ、こんど うち へ あそび に きて ください。",
                "en": "Please do come and visit us sometime.",
                "bd": "দয়া করে কখনও আমাদের বাড়িতে আসুন।"
            },
            {
                "jp": "とうきょう に くる とき は、ぜひ れんらく ください。",
                "en": "Please do contact me when you come to Tokyo.",
                "bd": "আপনি টোকিওতে আসলে, দয়া করে যোগাযোগ করুন।"
            },
            {
                "jp": "しゅうまつ、パーティー を する ので、ぜひ きて ください。",
                "en": "We are having a party on the weekend, so please do come.",
                "bd": "আমরা সপ্তাহান্তে একটি পার্টি করছি, তাই দয়া করে আসুন।"
            }
        ]
    },
    "16": {
        "key": "（目的）に行く / 来る / 帰る",
        "meaning_en": "go/come/go home (place) to do ~<br/>Used to indicate the purpose of going to a specific place.",
        "meaning_bd": "যেতে/আসতে/বাড়িতে (স্থান) ~ করতে<br/>কোন নির্দিষ্ট স্থানে যাবার উদ্দেশ্য প্রকাশে ব্যাবহৃত হয়।",
        "form": "N（場所）へ + V（ます形）ます + に行きます / 来ます / 帰ります<br/>N1（場所）へ + N2 + に行きます / 来ます / 帰ります ※N2はする動詞のN",
        "exampleSentence": [
            {
                "jp": "こんびにへ みずを かいに いきます。",
                "en": "I'm going to the convenience store to buy some water.",
                "bd": "আমি কনভিনিয়েন্স স্টোরে কিছু পানি কিনতে যাচ্ছি।"
            },
            {
                "jp": "きのう、でぱーとへ ふくを かいに いきました。",
                "en": "Yesterday, I went to a department store to buy clothes.",
                "bd": "গতকাল, আমি একটি ডিপার্টমেন্ট স্টোরে জামাকাপড় কিনতে গিয়েছিলাম।"
            },
            {
                "jp": "もーるへ えいがを みに いきます。",
                "en": "I'm going to the mall to watch a movie.",
                "bd": "আমি মলে একটি সিনেমা দেখতে যাচ্ছি।"
            }
        ]
    },
    "17": {
        "key": "あまり〜ない",
        "meaning_en": "'not very'<br/>Indicates a degree that’s not very high.<br/>When this is used, the verb is always used with a negative form.",
        "meaning_bd": "'খুব বেশি নয়'<br/>কোন কিছু খুব বেশি পরিমানে করা হয় না এরকম মাত্রা প্রকাশ করে।<br/>যখন এটি ব্যবহার করা হয়, তখন ক্রিয়াপদের নেতিবাচক রূপ ব্যবহার করা হয়।",
        "form": "あまり + V（否定形）<br/>あまり + イA（否定形）<br/>あまり + ナA（否定形）",
        "exampleSentence": [
            {
                "jp": "あまり Facebook は つかいません。",
                "en": "I don't use Facebook much.",
                "bd": "আমি ফেসবুক খুব একটা ব্যবহার করি না।"
            },
            {
                "jp": "すみません。あまり テレビ は みないので、その はなし は わかりません。",
                "en": "I'm sorry. I don't watch TV much, so I don't know what you're talking about.",
                "bd": "দুঃখিত। আমি খুব একটা টিভি দেখি না, তাই আমি আপনি যা বলছেন তা জানি না।"
            },
            {
                "jp": "ホラー えいが は にがて ですから、あまり みません。",
                "en": "I don't like horror movies, so I don't watch them much.",
                "bd": "আমি ভয়ঙ্কর সিনেমা পছন্দ করি না, তাই আমি সেগুলি খুব একটা দেখি না।"
            }
        ]
    },
    "18": {
        "key": "〜はどうですか",
        "meaning_en": "How about / How is<br/>Used to ask about the listener’s impression or opinion.",
        "meaning_bd": "কেমন / কেমন চলছে<br/>শ্রোতার মনোভাব বা মতামত সম্পর্কে জানতে ব্যবহৃত হয়।",
        "form": "N + はどうですか",
        "exampleSentence": [
            {
                "jp": "にほんりょうり は どう です か。おいしい です か。",
                "en": "How is Japanese cuisine? Is it tasty?",
                "bd": "আপনি জাপানি খাবার কেমন মনে করেন? এটি কি সুস্বাদু?"
            },
            {
                "jp": "えいが は どう でした か。おもしろかった です か。",
                "en": "How was the movie? Was it interesting?",
                "bd": "আপনার সিনেমাটি কেমন লাগলো? এটি কি মজার ছিল?"
            },
            {
                "jp": "りょこう は どう でした か。たのしかった です か。",
                "en": "How was your trip? Was it fun?",
                "bd": "আপনার ভ্রমণ কেমন ছিল? এটি কি আনন্দদায়ক ছিল?"
            }
        ]
    },
    "19": {
        "key": "〜ませんか",
        "meaning_en": "Would you like to ~ ? / Do you want to ~ ?<br/>Used to invite someone to do something.",
        "meaning_bd": "আপনি কি ~ করতে চান?<br/>কাউকে কোন কিছু করার আমন্ত্রণ জানাতে ব্যাবহৃত হয়।",
        "form": "V(ます形)ます + せんか",
        "exampleSentence": [
            {
                "jp": "しゅうまつ いっしょに えいがを みませんか。",
                "en": "Would you like to watch a movie together this weekend?",
                "bd": "আপনি কি এই সপ্তাহান্তে একসাথে সিনেমা দেখতে চান?"
            },
            {
                "jp": "こんばん いっしょに しょくじしませんか。",
                "en": "Would you like to have dinner with me tonight?",
                "bd": "আপনি কি আজ রাতে আমার সাথে খাবার খেতে চান?"
            },
            {
                "jp": "いっしょに かえりませんか。",
                "en": "Would you like to go home together?",
                "bd": "আপনি কি একসাথে বাড়িতে যেতে চান?"
            }
        ]
    },
    "20": {
        "key": "〜あとで",
        "meaning_en": "after",
        "meaning_bd": "পরে",
        "form": "V（タ形) + あとで<br/>N + のあとで",
        "exampleSentence": [
            {
                "jp": "としょかんで しゅくだいを した あとで、 かえります。",
                "en": "After doing my homework at the library, I will go home.",
                "bd": "লাইব্রেরিতে আমার হোমওয়ার্ক করার পরে আমি বাড়ি যাব।"
            },
            {
                "jp": "いまから すこし れんしゅうした あとで、 まえで はっぴょうしてもらいます。",
                "en": "After you have practiced a little, I will ask you to make a presentation in front of the class.",
                "bd": "আপনি একটু অনুশীলন করার পরে আমি আপনাকে ক্লাসের সামনে একটি উপস্থাপনা করতে বলব।"
            },
            {
                "jp": "でんしゃに のった あとで、 がっこうに わすれものを した ことに きがつきました。",
                "en": "After getting on the train, I realized that I forgot something at school.",
                "bd": "ট্রেনে ওঠার পরে আমি বুঝতে পারলাম যে আমি স্কুলে কিছু ভুলে গেছি।"
            }
        ]
    },
    "21": {
        "key": "〜でしょう（確認・同意）",
        "meaning_en": "'right?'<br/>is used to seek the listener’s confirmation or agreement.",
        "meaning_bd": "'তাই না?'<br/>শ্রোতা হতে কিছু নিশ্চিত করতে ব্যাবহৃত হয়",
        "form": "V（普通形）+ でしょう<br/>イA（普通形）+でしょう<br/>ナA（普通形） + でしょう ※ナAな + でしょう<br/>N（普通形） + でしょう ※Nだ + でしょう",
        "exampleSentence": [
            {
                "jp": "いま、わたし の こと を はなしていた でしょう？ なに はなしてた の？",
                "en": "You were talking about me just now, weren't you? What were you talking about?",
                "bd": "আপনি এখনই আমার সম্পর্কে কথা বলছিলেন, তাই না? আপনি কি কথা বলছিলেন?"
            },
            {
                "jp": "A: あれー、わたし の スマホ どこ？<br/>B: つくえ の うえ に ある でしょう？",
                "en": "A: Oh, where's my phone?<br/>B: It's probably on the desk.",
                "bd": "A: ওহ, আমার ফোন কোথায়?<br/>B: এটি সম্ভবত টেবিলের উপরে আছে।"
            },
            {
                "jp": "A: いま、わたし の こと みてた でしょう？<br/>B: み、みてない よ！",
                "en": "A: You were looking at me just now, weren't you?<br/>B: N-no, I wasn't!",
                "bd": "A: আপনি কি একটু আগে আমার দিকে তাকাচ্ছিলেন, তাই না?<br/>B: না, আমি তাকাই নি।"
            }
        ]
    },
    "22": {
        "key": "〜と思う",
        "meaning_en": "'I think'<br/>This is used to express the speaker’s conjecture or used when saying an opinion.",
        "meaning_bd": "'আমি মনে করি'<br/>এটি বক্তার অনুমান প্রকাশ করতে বা মতামত প্রকাশ করার সময় ব্যবহৃত হয়।",
        "form": "V（普通形）+ でしょう<br/>イA（普通形）+でしょう<br/>ナA（普通形）+ でしょう 　※ナA<s>な</s> + でしょう<br/>N（普通形） + でしょう　※N<s>だ</s> + でしょう",
        "exampleSentence": [
            {
                "jp": "きょうは ごごから あめが ふる と思います。",
                "en": "I think it will rain this afternoon.",
                "bd": "আমি মনে করি আজ দুপুরে বৃষ্টি হবে।"
            },
            {
                "jp": "トムさんは あとで くる と思います。",
                "en": "I think Tom will come later.",
                "bd": "আমি মনে করি টম পরে আসবে।"
            },
            {
                "jp": "たぶん、キムさんは なっとうが きらいだ と思います。",
                "en": "I think Kim probably dislikes natto.",
                "bd": "আমি মনে করি কিম সম্ভবত নাত্তো পছন্দ করে না।"
            }
        ]
    },
    "23": {
        "key": "〜なければならない",
        "meaning_en": "'must / have to'<br/>Used when the speaker says that it is necessary to do something or it must be done.",
        "meaning_bd": "'করতে হবে'<br/>কিছু করা প্রয়োজন বা এটি করতে হবে বুঝাতে ব্যবহৃত হয়।",
        "form": "V（ナイ形)な<s>い</s> + ければならない",
        "exampleSentence": [
            {
                "jp": "べんきょう しなければならない。",
                "en": "I must study.",
                "bd": "আমার পড়াশোনা করতে হবে।"
            },
            {
                "jp": "あした、しごと に いかなければならない。",
                "en": "I have to go to work tomorrow.",
                "bd": "আমাকে কাল কাজ করতে যেতে হবে।"
            },
            {
                "jp": "しけん を うける ため に は、じゅんび を しなければならない。",
                "en": "I must prepare to take the exam.",
                "bd": "পরীক্ষা দিতে হলে, আমাকে প্রস্তুতি নিতে হবে।"
            }
        ]
    },
    "24": {
        "key": "〜たい",
        "meaning_en": "'want to do'<br/>Used to express the speaker’s desire to do something.",
        "meaning_bd": "'করতে চাই'<br/>কিছু করার ইচ্ছা প্রকাশ করতে এটি ব্যবহৃত হয়।",
        "form": "V(ます形)<s>ます</s> + たい",
        "exampleSentence": [
            {
                "jp": "なつやすみ は うみ に いきたい です。",
                "en": "I want to go to the beach during my summer vacation.",
                "bd": "আমি গ্রীষ্মের ছুটিতে সমুদ্রে যেতে চাই।"
            },
            {
                "jp": "こんや は ラーメン が たべたい です。",
                "en": "I want to eat ramen tonight.",
                "bd": "আমি আজ রাতে রামেন খেতে চাই।"
            },
            {
                "jp": "にほんご を もっと べんきょう したい です。",
                "en": "I want to study Japanese more.",
                "bd": "আমি আরও জাপানি ভাষা শিখতে চাই।"
            }
        ]
    },
    "25": {
        "key": "〜が欲しい",
        "meaning_en": "'want'<br/>Expresses the speaker's desires or hopes.",
        "meaning_bd": "'চাই'<br/>বক্তার ইচ্ছা বা আশা প্রকাশ করে।",
        "form": "N + が欲しい",
        "exampleSentence": [
            {
                "jp": "もっと おかね が ほしい です。",
                "en": "I want more money.",
                "bd": "আমার আরও টাকা চাই।"
            },
            {
                "jp": "かのじょ が ほしい です。",
                "en": "I want a girlfriend.",
                "bd": "আমার একজন গার্লফ্রেন্ড চাই।"
            },
            {
                "jp": "Mac Book Pro が ほしい です。",
                "en": "I want a Mac Book Pro.",
                "bd": "আমার একটি Mac Book Pro চাই।"
            }
        ]
    },
    "26": {
        "key": "とても",
        "meaning_en": "'very'<br/>Indicates that the degree is large.",
        "meaning_bd": "'খুবই'<br/>তীব্রতা বুঝাতে ব্যাবহৃত হয়",
        "form": "",
        "exampleSentence": [
            {
                "jp": "このほん、とても おもしろい ですよ。",
                "en": "This book is very interesting.",
                "bd": "এই বইটি খুব মজার।"
            },
            {
                "jp": "まいにち とても いそがしい です。",
                "en": "I am very busy every day.",
                "bd": "আমি প্রতিদিন খুব ব্যস্ত।"
            },
            {
                "jp": "２がつ は とても さむい です。",
                "en": "It's very cold in February.",
                "bd": "ফেব্রুয়ারিতে খুব ঠান্ডা।"
            }
        ]
    },
    "27": {
        "key": "〜だけ",
        "meaning_en": "'only'<br/>Expresses a limitation.",
        "meaning_bd": "'শুধুমাত্র'<br/>সীমা বা সীমাবদ্ধতা বুঝায়",
        "form": "N + だけ<br/>数字 + 助数詞 + だけ",
        "exampleSentence": [
            {
                "jp": "わたし の やすみ は にちようび だけ です。どようび は しごと が あります。",
                "en": "My day off is only Sunday. I have to work on Saturday.",
                "bd": "আমার ছুটি শুধুমাত্র রবিবার। শনিবার আমাকে কাজ করতে হবে।"
            },
            {
                "jp": "きのう ３０ぷん だけ べんきょう しました。",
                "en": "I studied only half an hour yesterday.",
                "bd": "আমি গতকাল মাত্র ত্রিশ মিনিট পড়াশোনা করেছি।"
            },
            {
                "jp": "この クラス で フランスじん は ぼく だけ です。",
                "en": "I'm the only Frenchman in the class.",
                "bd": "আমি ক্লাসে একমাত্র ফরাসী।"
            }
        ]
    },
    "28": {
        "key": "どんな",
        "meaning_en": "'what kind of / what sort of'<br/>Used when you ask about the state or the character of a person, thing, etc.",
        "meaning_bd": "'কি ধরনের / কেমন ধরনের'<br/>ব্যক্তি, বস্তু ইত্যাদির অবস্থা বা চরিত্র সম্পর্কে জিজ্ঞাসা করার সময় ব্যবহৃত হয়।",
        "form": "どんな + N",
        "exampleSentence": [
            {
                "jp": "マレーシア は どんな くに ですか。",
                "en": "What is Malaysia like?",
                "bd": "মালয়েশিয়া কেমন দেশ?"
            },
            {
                "jp": "バンコク は どんな まち ですか。",
                "en": "What is Bangkok like?",
                "bd": "ব্যাংকক কেমন শহর?"
            },
            {
                "jp": "なっとう は どんな たべもの ですか。",
                "en": "What kind of food is natto?",
                "bd": "নাত্তো কেমন ধরনের খাবার?"
            }
        ]
    },
    "29": {
        "key": "もう〜した",
        "meaning_en": "already done<br/>Indicates the completion of an action or event.",
        "meaning_bd": "আগেই করা হয়েছে<br/>একটি ক্রিয়া বা ঘটনার সমাপ্তি নির্দেশ করে।",
        "form": "V（肯定形 + 過去形）",
        "exampleSentence": [
            {
                "jp": "もう ひるごはん を たべました か。",
                "en": "Have you eaten lunch yet?",
                "bd": "আপনি কি ইতিমধ্যে দুপুরের খাবার খেয়েছেন?"
            },
            {
                "jp": "もう しゅくだい を しました か。",
                "en": "Have you done your homework yet?",
                "bd": "আপনি কি ইতিমধ্যে বাড়ির কাজটি করেছেন?"
            },
            {
                "jp": "みなさん、もう きょうと に は いきました か？",
                "en": "Have you all been to Kyoto yet?",
                "bd": "আপনারা কি সবাই ইতিমধ্যে কিয়োতোর গিয়েছেন?"
            }
        ]
    },
    "30": {
        "key": "〜がいちばん",
        "meaning_en": "'the best'<br/>Indicates the highest degree of all (three or more) that are compared.",
        "meaning_bd": "'সেরা'<br/>তুলনায় থাকা (তিন বা ততোধিক) সকলের মধ্যে সর্বোচ্চ স্তর নির্দেশ করে।",
        "form": "N + がいちばん",
        "exampleSentence": [
            {
                "jp": "にほん りょうり で、 すきやき が いちばん すき です。",
                "en": "I like sukiyaki best among Japanese dishes.",
                "bd": "জাপানি খাবারের মধ্যে, আমি সুকিয়াকি সবচেয়ে পছন্দ করি।"
            },
            {
                "jp": "えいが の なかで コメディが いちばん すきです。",
                "en": "I like comedies the best among movies.",
                "bd": "ফিল্মের মধ্যে, আমি কমেডি সবচেয়ে পছন্দ করি।"
            },
            {
                "jp": "この がっこうで、 トムさん が いちばん せがたかい です。",
                "en": "Tom is the tallest person in this school.",
                "bd": "এই স্কুলে, টম সবচেয়ে লম্বা।"
            }
        ]
    },
    "31": {
        "key": "〜をください",
        "meaning_en": "please give me 〜<br/>A request expression. Used when ordering something at a restaurant, or when buying something at a store.",
        "meaning_bd": "দয়া করে আমাকে 〜 দিন<br/>অনুরোধের প্রকাশভঙ্গী। রেস্তোরাঁয় কিছু অর্ডার করার সময় বা দোকানে কিছু কেনার সময় এটি ব্যবহৃত হয়।",
        "form": "N + をください",
        "exampleSentence": [
            {
                "jp": "すみません、おみず を ください。",
                "en": "Excuse me, can I have some water, please?",
                "bd": "দুঃখিত, দয়া করে আমাকে কিছু জল দিন।"
            },
            {
                "jp": "ハンバーガー を ２つ ください。",
                "en": "Two hamburgers, please.",
                "bd": "দয়া করে দুটি হ্যামবার্গার দিন।"
            },
            {
                "jp": "これ を ください。",
                "en": "Please give me this.",
                "bd": "দয়া করে এটি দিন।"
            }
        ]
    },
    "32": {
        "key": "どうやって",
        "meaning_en": "This is used to ask the way how to do it.",
        "meaning_bd": "এটি কিভাবে করা যায় তা জিজ্ঞাসা করার জন্য ব্যবহৃত হয়।",
        "form": "",
        "exampleSentence": [
            {
                "jp": "えき まで どうやって いきますか。",
                "en": "How do you get to the station?",
                "bd": "আপনি স্টেশনটি কিভাবে যাবেন?"
            },
            {
                "jp": "これ は どうやって つかいますか。",
                "en": "How do you use this?",
                "bd": "এটি আপনি কিভাবে ব্যবহার করবেন?"
            },
            {
                "jp": "これ は どうやって たべますか。",
                "en": "How do you eat this?",
                "bd": "এটি আপনি কিভাবে খাবেন?"
            }
        ]
    },
    "33": {
        "key": "〜から",
        "meaning_en": "'because'<br/>Used to say the reason or cause.",
        "meaning_bd": "'~বলে/~কারণে'<br/>কারণ বা ব্যাখ্যা প্রকাশ করতে ব্যবহৃত হয়।",
        "form": "文１ + から + 文２",
        "exampleSentence": [
            {
                "jp": "きょう は むすこ の たんじょうび です から、 はやく かえります。",
                "en": "Today is my son's birthday, so I will go home early.",
                "bd": "আজ আমার ছেলের জন্মদিন, তাই আমি দ্রুত বাড়ি ফিরবো।"
            },
            {
                "jp": "にほん の かいしゃ で はたらきたい です から、 にほんご を べんきょう しています。",
                "en": "I want to work in a Japanese company, so I am studying Japanese.",
                "bd": "আমি জাপানি কোম্পানিতে কাজ করতে চাই, তাই আমি জাপানি ভাষা শিখছি।"
            },
            {
                "jp": "あした は テスト が ある から、 あそべません。",
                "en": "I have a test tomorrow, so I can't play.",
                "bd": "আমার কাল পরীক্ষা আছে, তাই আমি খেলতে পারবো না।"
            }
        ]
    },
    "34": {
        "key": "〜てから",
        "meaning_en": "'and then/after'<br/>This expresses that X is done before Y.",
        "meaning_bd": "'এবং তারপর/পরে'<br/>এটি প্রকাশ করে যে X, Y-এর আগে করা হয়।",
        "form": "V（て形）+ から",
        "exampleSentence": [
            {
                "jp": "て を あらって から ごはん を たべます。",
                "en": "I wash my hands before eating.",
                "bd": "আমি হাত ধুয়ে খাবার খাই।"
            },
            {
                "jp": "せんたく して から へや を そうじ します。",
                "en": "After doing the laundry, I'll clean the room.",
                "bd": "কাপড় ধোয়ার পর, ঘর পরিষ্কার করব।"
            },
            {
                "jp": "くつ を ぬいで から、 はいって ください。",
                "en": "Please take off your shoes before entering.",
                "bd": "দয়া করে জুতা খুলে ঘরে প্রবেশ করুন।"
            }
        ]
    }
}
  